//--------------------------------------------------------------//
//						ÂÍÅØÍÈÅ ÔÀÉËÛ							//
//--------------------------------------------------------------//
#include <stdlib.h>
#include <stdio.h>
#include "ds18b20.h"
#include "uart.h"
#include "periph_ini.h"
//--------------------------------------------------------------//
//							ÎÏÐÅÄÅËÅÍÈß							//
//--------------------------------------------------------------//
#define		INV_BIT(reg, bit)	reg ^= (1<<bit)
#define		LED_PIN				0
//--------------------------------------------------------------//
//						ÃËÎÁÀËÜÍÛÅ ÏÅÐÅÌÅÍÍÛÅ					//
//--------------------------------------------------------------//
char temp_buff[100];
//--------------------------------------------------------------//
//						ÏÐÎÒÎÒÈÏÛ ÔÓÍÊÖÈÉ						//
//--------------------------------------------------------------//
/*ñîçäàíèå ïîòîêà usart_out òèïà FILE
íàçíà÷åíèå ôóíêöèè usart_putchar äëÿ âûâîäà â ïîòîê*/
FILE usart_out = FDEV_SETUP_STREAM(usart_putchar, NULL, _FDEV_SETUP_WRITE);
//--------------------------------------------------------------//
//						ÎÑÍÎÂÍÀß ÔÓÍÊÖÈß						//
//--------------------------------------------------------------//
int main(void)
{
	stdout = &usart_out;
	port_ini();
	usart_ini();
	printf("%s\r", "--------------------------");
#ifdef DEBUG
		printf("%s\r", "Debug version is running");
#else
		printf("%s\r", "Release version is running");
#endif
		printf("%s\r", "--------------------------");
//-----------------------ÄÈÑÏÅÒ×ÅÐ------------------------------//
	while(1)
	{
		double temperature = ds18b20_gettemp();
		printf("%s %s\r", "Temperature:", dtostrf(temperature, 10, 4, temp_buff));
		INV_BIT(PORTB, LED_PIN);
		_delay_ms(500);
	}
	return 0;
}
